20240505T012745--kdoc-n-kdocは何ではない__draft_essay.org
:properties:
:ID: 20240505T012745
:end:
#+title:      KDOC n: KDOCは何ではない
#+date:       [2024-05-05 Sun 01:27]
#+filetags:   :draft:essay:
#+identifier: 20240505T012745

#+caption: 最大値を求めるやつ。C-c C-cして出てくるS式を実行する
#+begin_src shell :results raw
  result=`ls | grep -oE 'kdoc-[0-9]+' | sed 's/kdoc-//' | sort -nr | head -n 1`
  succ=$((result + 1))

  echo $(cat <<EOF
  (save-excursion
    (while (re-search-backward "KDOC n" nil t)
      (replace-match "KDOC $succ")))
  EOF
  )
#+end_src

# (denote-rename-file-using-front-matter (buffer-file-name) 0)
# (save-excursion (while (re-search-backward ":draft" nil t) (replace-match "")))
# (flush-lines "^\\#\s.+?")

# ====ポリシー。
# 1ファイル1アイデア。
# 1ファイルで内容を完結させる。
# 常にほかのエントリとリンクする。
# 自分の言葉を使う。
# 参考文献を残しておく。
# 文献メモの場合は、感想と混ぜないこと。1つのアイデアに反する
# 自分の考えを加える。
# 構造を気にしない。
# エントリ間の接続を発見したら、接続エントリを追加する。カード間にあるリンクの関係を説明するカード。
# アイデアがまとまったらアウトラインエントリを作成する。リンクをまとめたエントリ。
# エントリを削除しない。古いカードのどこが悪いかを説明する新しいカードへのリンクを追加する。
# 恐れずにカードを追加する。無意味の可能性があっても追加しておくことが重要。

* この文書のステータス
- 作成
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))
- レビュー
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))

# 関連をつけた。
# タイトルがフォーマット通りにつけられている。
# 内容をブラウザに表示して読んだ(作成とレビューのチェックは同時にしない)。
# 文脈なく読めるのを確認した。
# おばあちゃんに説明できる。
# いらない見出しを削除した。
# タグを適切にした。
# すべてのコメントを削除した。
* 概要
# 文書の短いまとめ。
ではない。

- 百科事典ではない

  網羅を目的としていない。条件を満たす、関連する可能性のあるトピックだけを追加し、ノイズを増やさないようにする。

- 日記ではない

  単なる感想や感情を書く場所ではない。自分のアイデアを表現しなければならない。

- コード置き場ではない

  単純なコードを保存する場所ではない。

* イントロ
# 目的。
# 問題意識の共有。
# 前提知識の共有。

* 本文
# 本文(タイトルをつける)。

* 関連
# 関連するエントリ。なぜ関連させたか理由を書く。
