20240505T012745--kdoc-n-kdocは何ではない__draft_essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC n: KDOCは何ではない</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC n: KDOCは何ではない</h1>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>最大値を求めるやつ。C-c C-cして出てくるS式を実行する</label><pre class="src src-shell"><span class="org-variable-name">result</span>=<span class="org-sh-quoted-exec">`ls | grep -oE 'kdoc-[0-9]+' | sed 's/kdoc-//' | sort -nr | head -n 1`</span>
<span class="org-variable-name">succ</span>=$((result + 1))

<span class="org-builtin">echo</span> $(cat &lt;&lt;EOF
<span class="org-sh-heredoc">(save-excursion</span>
<span class="org-sh-heredoc">  (while (re-search-backward "KDOC n" nil t)</span>
<span class="org-sh-heredoc">    (replace-match "KDOC $succ")))</span>
<span class="org-sh-heredoc">EOF</span>
)
</pre>
</div>

<div id="outline-container-orgd757179" class="outline-2">
<h2 id="orgd757179"><a href="#orgd757179">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgd757179">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8bd76ed" class="outline-2">
<h2 id="org8bd76ed"><a href="#org8bd76ed">概要</a></h2>
<div class="outline-text-2" id="text-org8bd76ed">
<p>
ではない。
</p>

<ul class="org-ul">
<li><p>
百科事典ではない
</p>

<p>
網羅を目的としていない。条件を満たす、関連する可能性のあるトピックだけを追加し、ノイズを増やさないようにする。
</p></li>

<li><p>
日記ではない
</p>

<p>
単なる感想や感情を書く場所ではない。自分のアイデアを表現しなければならない。
</p></li>

<li><p>
コード置き場ではない
</p>

<p>
単純なコードを保存する場所ではない。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orga66588b" class="outline-2">
<h2 id="orga66588b"><a href="#orga66588b">イントロ</a></h2>
<div class="outline-text-2" id="text-orga66588b">
</div>
</div>

<div id="outline-container-org83a5ec6" class="outline-2">
<h2 id="org83a5ec6"><a href="#org83a5ec6">本文</a></h2>
<div class="outline-text-2" id="text-org83a5ec6">
</div>
</div>

<div id="outline-container-org2e2fec9" class="outline-2">
<h2 id="org2e2fec9"><a href="#org2e2fec9">関連</a></h2>
<div class="outline-text-2" id="text-org2e2fec9">
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
